### Import the necessary libraries

In [14]:
from dotenv import load_dotenv
import os
import pandas as pd
import sqlalchemy as alch

load_dotenv()

True

### Store your username and password for the database
You can choose to do this with getpass or with an environment variable.

In [15]:
dbName="publications"
user = "fran"
password = os.getenv("PASSWORD")

## Establishes the connection to the database

In [18]:
connectionData=f"mysql+pymysql://{user}:{password}@localhost/{dbName}"

engine = alch.create_engine(connectionData)

Engine(mysql+pymysql://fran:***@localhost/publications)

### Remember to create the engine

In [19]:

print("Connected to server!")

Connected to server!

## Challenge 1 - Who Have Published What At Where?
In this challenge you will write a MySQL `SELECT` query that joins various tables to figure out what titles each author has published at which publishers. Your output should have at least the following columns:

* `AUTHOR ID` - the ID of the author
* `LAST NAME` - author last name
* `FIRST NAME` - author first name
* `TITLE` - name of the published title
* `PUBLISHER` - name of the publisher where the title was published

In [22]:
df = pd.read_sql_query(
"""
SELECT 
    author.au_id AS 'AUTHOR ID',
    author.au_fname AS 'FIRST NAME',
    author.au_lname AS 'LAST NAME',
    title.title AS 'TITLE',
    publisher.pub_name AS 'PUBLISHER'
FROM
    authors as author
        INNER JOIN
    titleauthor as ta ON author.au_id = ta.au_id
        INNER JOIN
    titles as title ON ta.title_id = title.title_id
        INNER JOIN
    publishers as publisher ON title.pub_id = publisher.pub_id

""", engine
)
df.head()

,AUTHOR ID,FIRST NAME,LAST NAME,TITLE,PUBLISHER
0,213-46-8915,Marjorie,Green,The Busy Executive's Database Guide,Algodata Infosystems
1,409-56-7008,Abraham,Bennet,The Busy Executive's Database Guide,Algodata Infosystems
2,267-41-2394,Michael,O'Leary,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
3,724-80-9391,Stearns,MacFeather,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
4,213-46-8915,Marjorie,Green,You Can Combat Computer Stress!,New Moon Books

## Challenge 2 - Who Have Published How Many At Where?
More info in the readme.md

In [24]:
df2 = pd.read_sql_query(
"""
SELECT 
    author.au_id AS 'AUTHOR ID',
    author.au_fname AS 'FIRST NAME',
    author.au_lname AS 'LAST NAME',
    publisher.pub_name AS 'PUBLISHER',
    COUNT(title.title_id) AS 'TITLE COUNT'
FROM
    authors AS author
        INNER JOIN
    titleauthor AS ta ON author.au_id = ta.au_id
        INNER JOIN
    titles AS title ON ta.title_id = title.title_id
        INNER JOIN
    publishers AS publisher ON title.pub_id = publisher.pub_id
GROUP BY author.au_id , publisher.pub_id;

""", engine
)
df2.head()

     AUTHOR ID FIRST NAME LAST NAME       PUBLISHER  TITLE COUNT
0  213-46-8915   Marjorie     Green  New Moon Books            1
1  899-46-2035       Anne    Ringer  New Moon Books            1
2  998-72-3567     Albert    Ringer  New Moon Books            2
3  172-32-1176    Johnson     White  New Moon Books            1
4  486-29-1786   Charlene  Locksley  New Moon Books            1

## Challenge 3 - Best Selling Authors
More info in the readme.md

In [25]:
df3 = pd.read_sql_query(
"""
SELECT 
    author.au_id AS 'AUTHOR ID',
    author.au_fname AS 'FIRST NAME',
    author.au_lname AS 'LAST NAME',
    SUM(sale.qty) AS 'TOTAL'
FROM
    authors as author
        INNER JOIN
    titleauthor as ta ON ta.au_id = author.au_id
        INNER JOIN
    titles as title ON title.title_id = ta.title_id
        INNER JOIN
    sales as sale ON sale.title_id = title.title_id
GROUP BY author.au_id
ORDER BY TOTAL DESC
LIMIT 3;

""", engine
)
df3.head()

     AUTHOR ID FIRST NAME LAST NAME  TOTAL
0  899-46-2035       Anne    Ringer  148.0
1  998-72-3567     Albert    Ringer  133.0
2  213-46-8915   Marjorie     Green   50.0

## Challenge 4 - Best Selling Authors Ranking
More info in the readme.md

In [31]:
df4 = pd.read_sql_query(
"""
SELECT 
    author.au_id AS 'AUTHOR ID',
    author.au_fname AS 'FIRST NAME',
    author.au_lname AS 'LAST NAME',
    COALESCE(SUM(sale.qty), 0) AS 'TOTAL'
FROM
    authors as author
        LEFT JOIN
    titleauthor as ta ON ta.au_id = author.au_id
        LEFT JOIN
    titles as title ON title.title_id = ta.title_id
        LEFT JOIN
    sales as sale ON sale.title_id = title.title_id
GROUP BY author.au_id
ORDER BY TOTAL DESC;

""", engine
)
df4.sample(23).sort_values(by=['TOTAL'] , ascending=False)

      AUTHOR ID   FIRST NAME       LAST NAME  TOTAL
0   899-46-2035         Anne          Ringer  148.0
1   998-72-3567       Albert          Ringer  133.0
2   213-46-8915     Marjorie           Green   50.0
4   846-92-7186       Sheryl          Hunter   50.0
3   427-17-2319          Ann            Dull   50.0
6   724-80-9391      Stearns      MacFeather   45.0
5   267-41-2394      Michael         O'Leary   45.0
7   722-51-5454       Michel        DeFrance   40.0
8   807-91-6654       Sylvia        Panteley   40.0
9   238-95-7766       Cheryl          Carson   30.0
10  486-29-1786     Charlene        Locksley   25.0
11  472-27-2349         Burt      Gringlesby   20.0
14  756-30-7391        Livia          Karsen   20.0
13  672-71-3249        Akiko        Yokomoto   20.0
12  648-92-1872     Reginald  Blotchet-Halls   20.0
16  274-80-9391         Dean        Straight   15.0
15  172-32-1176      Johnson           White   15.0
17  409-56-7008      Abraham          Bennet   15.0
18  712-45-1867        Innes    del Castillo   10.0
22  893-72-1158      Heather        McBadden    0.0
19  341-22-1782      Meander           Smith    0.0
20  527-72-3246  Morningstar          Greene    0.0
21  724-08-9931         Dirk        Stringer    0.0

## Bonus Challenge - Most Profiting Authors